InformationRegisters/КлючиДоступаСервисаСемантическогоАнализа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КлючиДоступаСервисаСемантическогоАнализа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КлючиДоступаСервисаСемантическогоАнализа/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Записывает ключи доступа к сервису семантического анализа в регистр.
// 
// Параметры:
//  КлючиДоступа - РегистрСведенийМенеджерЗаписи.КлючиДоступаСервисаСемантическогоАнализа - КлючиДоступа.
Процедура УстановитьКлючиДоступа(КлючиДоступа) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.КлючиДоступаСервисаСемантическогоАнализа");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.КлючиДоступаСервисаСемантическогоАнализа.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			НаборЗаписей.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НаборЗаписей[0], КлючиДоступа);
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Возвращает ключи доступа к сервису семантического анализа.
// 
// Возвращаемое значение:
//  РегистрСведенийМенеджерЗаписи.КлючиДоступаСервисаСемантическогоАнализа - Ключи доступа.
Функция КлючиДоступа() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(КлючиДоступаСервисаСемантическогоАнализа.ИдентификаторПриложения, """") КАК ИдентификаторПриложения,
		|	ЕСТЬNULL(КлючиДоступаСервисаСемантическогоАнализа.КлючДоступа, """") КАК КлючДоступа,
		|	ЕСТЬNULL(КлючиДоступаСервисаСемантическогоАнализа.КлючИзменения, """") КАК КлючИзменения
		|ИЗ
		|	РегистрСведений.КлючиДоступаСервисаСемантическогоАнализа КАК КлючиДоступаСервисаСемантическогоАнализа";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РегистрыСведений.КлючиДоступаСервисаСемантическогоАнализа.СоздатьМенеджерЗаписи();
	Иначе
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
